{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "PReLU", "config": {"name": "output", "trainable": true, "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "alpha_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}